In [ ]:
import pandas as pd

In [ ]:
data = {
    'name': ['John', 'Mary', 'Peter', 'Lisa'],
    'age': [25, 30, 28, 35],
    'city': ['New York', 'Paris', 'London', 'Tokyo'],
    'salary': [50000, 80000, 60000, 90000]
}

In [ ]:
df = pd.DataFrame(data)

In [ ]:
df

In [ ]:
df['salary']

In [11]:
df.salary

0    50000
1    80000
2    60000
3    90000
Name: salary, dtype: int64

In [12]:
df[['name', 'age']]

    name  age
0   John   25
1   Mary   30
2  Peter   28
3   Lisa   35

In [13]:
df.columns

Index(['name', 'age', 'city', 'salary'], dtype='object')